#include "key.h"


/*********************************全局变初始化***********************************/  
u8 KeyValue = 0;

/******************************************************************************/
/* 函数名称  : KEY_Delay                                                      */
/* 函数描述  : KEY延时                                                        */
/* 输入参数  : Void                                                           */
/* 参数描述  : 无                                                             */
/* 返回值    : 无                                                             */
/******************************************************************************/
void key_delay_ms(u16 xms)
{
   u16 i;
	 do{
	    i = (u16)(MAIN_Fosc / 13000);
		  while(--i)	;   //14T per loop
     }while(--xms);
}

/******************************************************************************/
/* 函数名称  : KEY_Scan                                                       */
/* 函数描述  : KEY扫描                                                        */
/* 输入参数  : Void                                                           */
/* 参数描述  : 无                                                             */
/* 返回值    : 无                                                             */
/******************************************************************************/	
void ReadKey(void)
{
	u8 key = 0;
	u8 second_key = 0;
	static u8 i = 10;
	
	P3 |= 0x78;
	key = P3 & 0x78;	
	if (key != 0x78) {
		key_delay_ms(10);
		second_key = P3 & 0x78;
		if (key == second_key) {
			KeyValue = ((~key) >> 3) & 0x0f;
			while(((P3 & 0x78) != 0x78) && i) {
				i -- ;
				key_delay_ms(100);
			};
		}
	} else {
		i = 10;
	}
}

